In [1]:
import pandas as pd
import numpy as np

In [30]:
df = pd.read_excel("./data/ad-sales.xlsx")

In [36]:
df = df.astype({"광고비(백만원)" : "category"})

In [33]:
df.head()

    월  광고비(백만원)  매출액(억원)
0  1월         2      100
1  2월       142     1690
2  3월       122      298
3  4월       130      390
4  5월       185      590

In [37]:
df.describe()

           매출액(억원)
count    12.000000
mean    538.166667
std     428.774540
min     100.000000
25%     273.500000
50%     425.000000
75%     652.500000
max    1690.000000

In [43]:
df.describe(include = ['object', 'category'])

         월  광고비(백만원)
count   11        12
unique  11        12
top     2월         2
freq     1         1

In [41]:
df.iloc[0, 0] = np.nan

In [48]:
df.describe(include = 'category')

        광고비(백만원)
count         12
unique        12
top            2
freq           1

In [49]:
df.head()

     월 광고비(백만원)  매출액(억원)
0  NaN        2      100
1   2월      142     1690
2   3월      122      298
3   4월      130      390
4   5월      185      590

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   월         11 non-null     object
 1   광고비(백만원)  12 non-null     category
 2   매출액(억원)   12 non-null     int64
dtypes: category(1), int64(1), object(1)
memory usage: 732.0+ bytes

In [51]:
df.describe()

           매출액(억원)
count    12.000000
mean    538.166667
std     428.774540
min     100.000000
25%     273.500000
50%     425.000000
75%     652.500000
max    1690.000000